<html>
<head>
     <link href="https://fonts.googleapis.com/css2?family=Press+Start+2P&display=swap" rel="stylesheet">
    <link rel="stylesheet" href="\main\style.css">
    <title>Главная</title>
</head>
<body>
    <header class="head">
        <div class="gog">Good Old Games</div>
        <div class="forgot">Игры про которые все забыли</div>
    </header>
    <div class="main">
        <div class="container">
            <div class="tetscreen">
                <a href="\Tetris\TetrisIndex.php" title="Перейти на страницу с игрой Tetris">
                    <img src="\Tetris\tetris.jpg">
                </a>
            </div>
            <div class="tettext">
                «Тетрис» представляет собой головоломку, построенную на использовании геометрических фигур «тетрамино».Случайные фигурки тетрамино падают сверху в прямоугольный стакан шириной 10 и высотой 20 клеток. В полёте игрок может поворачивать фигурку на 90° и двигать её по горизонтали. Также можно «сбрасывать» фигурку, то есть ускорять её падение, когда уже решено, куда фигурка должна упасть. Фигурка летит до тех пор, пока не наткнётся на другую фигурку либо на дно стакана.
            </div>
        </div>
        <div class="container">
            <div class="sntext">
                Snake (Питон, Удав, Змейка и др.) — компьютерная игра, впервые появившаяся в кнопочном телефоне Nokia 6110. Разработана финским разработчиком Танели Арманто и выпущена компанией Nokia.Игрок управляет длинным, тонким существом, напоминающим змею, которое ползает по плоскости, собирая еду , избегая столкновения с собственным хвостом. Каждый раз, когда змея съедает кусок пищи, она становится длиннее, что постепенно усложняет игру
            </div>
            <div class="snscreen">
                <a href="\snake\SnakeIndex.php" title="Перейти на страницу с игрой Snake">
                    <img src="\snake\snake.jpg">
                </a>
            </div>
        </div>
        <div class="container">
            <div class="brscreen">
                <a href="\breakout\BreakoutIndex.php" title="Перейти на страницу с игрой Breakout">
                    <img src="\breakout\breakout.jpg">
                </a>
            </div>    
            <div class="brtext">
                Игровой автомат Breakout был создан Ноланом Бушнелем, а исходная разработка была выполнена сооснователем компании Apple Computer Стивом Возняком. Верхняя треть игрового экрана занята рядами брусков. По экрану, отскакивая от верхней и боковых границ экрана, движется мяч. Попадая в брусок, мяч отскакивает, а брусок исчезает. Игра заканчивается, когда мяч ударяется в нижнюю часть экрана; чтобы предотвратить это, у игрока есть подвижная ракетка, с помощью которой мяч можно отбросить обратно в верхнюю часть экрана.
            </div> 
        </div>
        
        
        
    </div>
    <footer class="foot">
        Belarus, 17.12.2021.
    </footer>
</body>
</html>